var ptx_lunr_search_style = "textbook";
var ptx_lunr_docs = [
{
  "id": "preface",
  "level": "1",
  "url": "preface.html",
  "type": "Preface",
  "number": "",
  "title": "Preface",
  "body": " テトリスを様々な側面から代数的に解析する諸研究は、その興味深さとは裏腹にまとまった参照先が存在せず、前提知識も必須であり、敷居が少し高いのが現状である。 本書はそのような代数学の基礎と、そのテトリスへの豊かな応用を集積し、今ある巨大な知識格差を是正することを目的とし、必要な理論を体系的に学ぶことができるオンライン教科書である。  特にパリティ追跡理論(PTT)は、一手ごとに刻々と変化するパリティを「群作用」という形でモデル化し、さまざまな考察を数学という強固な後ろ盾のもとに行えるようにした重要な理論である。  加えて本書は、可換環論を用いた領域のタイリング可能性の判定についても解説する。パリティ追跡がパリティの「動的」な変化をとらえるものであったのと対照的に、この理論ではさまざまなミノに対する地形の変化を扱いやすい形で書き、「汎函数」とよばれる写像と比べることによって充填可能性という「静的」な性質を証明する。 パリティ追跡の基礎理論は完成していると言っても差し支えないと思うが、こちらの方は手法が純粋数学に近い分、未開拓の結果や一般化がそれこそ巨大な氷山のようにどっさりと残されているというのが著者の所感である。元に、未解決問題がいくつも提起されている。  本書の目標はこの2つの理論を、必要な基礎知識を丁寧に補ったのちに解説することである。具体的には集合論、群論、可換環論、圏論、順序集合の一般論を説明し、第II部よりテトリスへの応用を論じる。他を参照しなくとも本書のみで進められるように(Self-contained)解説する。  第I部では読者により広域な視点を与えるため、のちに必要なものだけに絞って解説するようなことはせずに、各理論の一般論を通常の数学書と同等程度で展開する方針をとった。 そのぶん重くなり過ぎないよう、例や命題を多数紹介することは避けた。書いている途中で数学畑の筆者は数学徒の血が騒ぎ、各章に1つ、現代数学とその章の内容との関わりを紹介するコラムを設けた。 扱う内容は「コラム」どころかどれもこれも本書のレベルを超えうるものばかりだが、その内容を通して数学の面白さを知っていただければ著者の至上の喜びである。第I部でのみ各章の終わりに演習問題をつけた。 簡単なものが多いが、少し考えを要するものやコラムの内容が必要なもの、数学の専門知識を要するものも出題した。それらにはそれぞれH,C,K (Hard, Column, Knowledge)のアルファベットをつけて無印の簡単な問題と区別した。 無印は全てとは言わずとも、8, 9割は解けるようになっていただきたいものである。難易度調整として、難問にはほとんど誘導をつけたため、実際にはあまりHardではない可能性がある。  各問題には略解(Answer.)かヒント(Hint.)を設け、読者の理解を助けるようにした。なお全ての解答とヒントは、数学書から問題を引っ張ってきた著者がその場で思いついて書くとかいうキチガイ執筆メソッドを採用しているため、万が一にも間違っている可能性が存在することをこの場を借りて詫びておきたい。  第II部では、Ogonek:Macron氏のnoteの行間を埋める形でパリティ追跡理論を解説し、つづけてタイリングの理論を解説する。  最後に、Ogonek:Macron氏に著者の大雑把極まりない原稿をお読みいただき、多数のご指摘・修正を賜った。この場を借りて感謝の意を表したい。  "
},
{
  "id": "front-colophon",
  "level": "1",
  "url": "front-colophon.html",
  "type": "Colophon",
  "number": "",
  "title": "Colophon",
  "body": "  "
},
{
  "id": "sets-and-mathematics",
  "level": "1",
  "url": "sets-and-mathematics.html",
  "type": "Section",
  "number": "1.1",
  "title": "集合と現代数学",
  "body": " 集合と現代数学  集合論は第6章で学ぶ圏論と並んで、現代数学の土台をなしていると言ってもよい。  現代数学で定義されるほとんどの概念は集合である。関数も集合、群も集合、自然数も集合...といったように、 大抵の概念を集合として捉えるのが現代数学の立場である。  代数学に限らずとも、解析学(微分積分)や測度論(\"面積\"や\"体積\"を厳密に基礎付ける理論)、および位相空間(幾何学の土台)は集合論なしに定式化できない。 このように数学の基礎をなす集合であるが、その適用範囲の広さだけに抽象的である。高校1年生の数学Aでやるような元と包含から初めて、 一般の集合について取り扱う本書では、適切にRemarkを挿入することにより、このような抽象生の\"段差\"をくどくならない程度に取り除くことに務めた。  著者は圏論的な考え方を極めて重要視しているため、集合や代数構造自体と同じかそれ以上に、 その間に走る\"良い関数\"の存在と対象同士の関係を重視する立場をとる。  上のような理由のため、様々な概念についてなりたつ普遍的で汎用性のある性質を積極的に利用する。最初は証明に違和感を覚えるかもしれないが、 この本は数学のレクチャーノートでもある。読者の多面的な思考を促し、現代的な方法に慣れさせることを優先した。  "
},
{
  "id": "set-and-logic",
  "level": "1",
  "url": "set-and-logic.html",
  "type": "Section",
  "number": "1.2",
  "title": "集合と論理",
  "body": " 集合と論理  集合の元や包含関係に関する用語を準備することから始めよう。この本では集合の定義はしないが、その理由についてこの節の最後で少し触れる。  と書いて、 は 集合(Set) の 元(element) という。 逆に書くこともある( )。 であることを、 が に 属する(belong) ともいう。 をなにか空間的なものとして扱う時(例えば三次元ユークリッド空間 も集合である)、 を の点であるという。  数学者のほとんどは元を小文字で、集合を大文字で書く習慣がある。できる限り数学の習慣に従った書き方をすれば、数学的記述をわかりやすいものにすることができる。  を集合とする。任意の に対し、 なら であることを と書いて、 は の 部分集合である(subset) という。これも逆に書くことがある。 であるとき、 と書き、 これら集合は 等しい という。  数学における条件を記述する場合、込み入った内容になればなるほど、書き手でさえも混乱を生じる可能性がある。これを避けるために 論理記号(logical symbol) を 導入する。 が についての何らかの条件を表しているとき、「 ならば である」ことを と書く。 また、「任意の について が成り立つ」という文は と 全称記号(universal quantifier) で書くことにより表現し、 逆に「 を成り立たせるような が(複数あってもよい)存在する」という文は 存在記号(existential quantifier) を使って と表す。 にエクスクラメーションマーク(!)をつけて とすることにより、だた1つ存在することを表す(一意的に存在する、という)。  集合 とその任意の元 を考える。 を についてのなんらかの条件とするとき、 を満足するような の全体は自然に の部分集合となる。 これを や で表し、 内包表記(builder notation) による表示などという。  元を全く含まない集合を空集合という。内包表記で定義すると、 である。  集合 の元 のペア を 順序対(ordered pair) といい、順序対全体の集合を と書き、 直積集合(product set) という。 自然数 に対し、 回の直積を で表す。  関数という言葉は通常、数から数への対応関係のことを指すであろう。現代数学においては定義域と値域を拡張し、任意の集合とする。この概念を 写像(mapping) という。 これはほとんど言葉の些細な用法の違いであるが、関数といえば特に数から数への写像であると思ってよい。 集合 から への写像 のことを と書き、 に対して が対応することを で表す。 写像を定義する場合には例えば などと書く( は実数の集合)。   で、 であるときに限り、 写像の合成(composition) を、 で定義する。   つまらない例ではあるが、 平面は と思うことができる。     任意の集合 と、任意の写像 が与えられているとする。直積 と、その 射影(projection) に対して、  一意に定まる写像の存在: 集合 から への写像 が 一意的に存在する。    可換性の条件: 1.の写像 は、 かつ   が成り立つ。    具体的に写像を構成して示す。 とおく。 を で定義する。 は という送り方をするので、題意が従う。 についても同じように考えれば明らかである。 一意性を示そう。仮に の他に が存在して、 となったとき、可換性から である。 は とも等しかったので、 の定義から、結局同じ写像を考えていることになっている。 つまり、他に可換性を満たすような写像を考えても に一致する。これはつまり一意性を意味する。     これは、第6章で学ぶ 圏論(Category theory) の結果を下ろしてきたものである。直積は集合論における非常に基本的な構成法であり、のちに学ぶ群論や可換環論でも頻出する。 圏論的には、集合とは、集合全体の集まり(圏 )の一点のようなものである。上の命題では集合のすべての直積に成り立つ普遍的性質を証明したが、群や可換環、はたまた集まりの集まり(小圏の圏)に至るまで同じ命題が成り立つ。 異なる対象の集まり同士の間に共通の構造を見出すことこそが圏論の一つの大きな意義である。 なお、直積の兄弟的存在として Disjoint union(非交和) がある。これは で定義される。Disjoint unionの各元は という形をしているが、これは の出身が0(Aから)か1(Bから)でラベル付けされているようなものと思ってよい。 さきほどの命題における直積をDisjoint unionに、そして写像の向きをすべて逆にすれば、Disjoint unionについても同様の命題が成立する。   "
},
{
  "id": "set-and-logic-3",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-3",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "集合(Set) 元(element) 属する(belong) "
},
{
  "id": "set-and-logic-5",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-5",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "部分集合である(subset) 等しい "
},
{
  "id": "set-and-logic-6",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-6",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "論理記号(logical symbol) 全称記号(universal quantifier) 存在記号(existential quantifier) "
},
{
  "id": "set-and-logic-7",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-7",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "内包表記(builder notation) "
},
{
  "id": "set-and-logic-9",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-9",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "順序対(ordered pair) 直積集合(product set) "
},
{
  "id": "set-and-logic-10",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-10",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "写像(mapping) "
},
{
  "id": "set-and-logic-11",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-11",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "写像の合成(composition) "
},
{
  "id": "set-and-logic-12",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-12",
  "type": "Example",
  "number": "1.2.1",
  "title": "",
  "body": " つまらない例ではあるが、 平面は と思うことができる。  "
},
{
  "id": "prop-product-univ",
  "level": "2",
  "url": "set-and-logic.html#prop-product-univ",
  "type": "Proposition",
  "number": "1.2.2",
  "title": "",
  "body": "  任意の集合 と、任意の写像 が与えられているとする。直積 と、その 射影(projection) に対して、  一意に定まる写像の存在: 集合 から への写像 が 一意的に存在する。    可換性の条件: 1.の写像 は、 かつ   が成り立つ。    具体的に写像を構成して示す。 とおく。 を で定義する。 は という送り方をするので、題意が従う。 についても同じように考えれば明らかである。 一意性を示そう。仮に の他に が存在して、 となったとき、可換性から である。 は とも等しかったので、 の定義から、結局同じ写像を考えていることになっている。 つまり、他に可換性を満たすような写像を考えても に一致する。これはつまり一意性を意味する。   "
},
{
  "id": "set-and-logic-14",
  "level": "2",
  "url": "set-and-logic.html#set-and-logic-14",
  "type": "Remark",
  "number": "1.2.3",
  "title": "",
  "body": " これは、第6章で学ぶ 圏論(Category theory) の結果を下ろしてきたものである。直積は集合論における非常に基本的な構成法であり、のちに学ぶ群論や可換環論でも頻出する。 圏論的には、集合とは、集合全体の集まり(圏 )の一点のようなものである。上の命題では集合のすべての直積に成り立つ普遍的性質を証明したが、群や可換環、はたまた集まりの集まり(小圏の圏)に至るまで同じ命題が成り立つ。 異なる対象の集まり同士の間に共通の構造を見出すことこそが圏論の一つの大きな意義である。 なお、直積の兄弟的存在として Disjoint union(非交和) がある。これは で定義される。Disjoint unionの各元は という形をしているが、これは の出身が0(Aから)か1(Bから)でラベル付けされているようなものと思ってよい。 さきほどの命題における直積をDisjoint unionに、そして写像の向きをすべて逆にすれば、Disjoint unionについても同様の命題が成立する。  "
},
{
  "id": "well-definedness",
  "level": "1",
  "url": "well-definedness.html",
  "type": "Section",
  "number": "1.3",
  "title": "well-definedness",
  "body": " well-definedness  この節では、代数学において頻出する(退屈だが)重要な概念である、定義の well-definedness について解説する。  ある概念の定義のwell-definednessとは定義が数学的に矛盾したり、循環していないときに使用する言葉である。   という有理数は、 を満たす が一意的に存在することを根拠に定義される。では、ゼロで割ることを考えてみてはどうか? この場合、 となる は存在しない。したがって、ゼロで割るという操作はwell-definedではない(定義の根拠が崩壊している)。 分子が0でも同様に、 だから、 となる は任意の数が該当するため、well-definedではない(定義が一通りに定まらない)。  他にも重要な例として、関数 は、 に対して がただ一つ決まらない場合はwell-definedではなく、関数とは呼べない。 これは の場合と同じように、定義の方法が一通りに定まらないことによる。  だから例えば、実数 に対してその平方根を返すような関数は、平方根が正負両方の値を取りうるため、well-definedではない。ここで注意されたいのは、 2つの元に対して1つの値が定まるような関数はwell-definedである ということである。  "
},
{
  "id": "well-definedness-2",
  "level": "2",
  "url": "well-definedness.html#well-definedness-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "well-definedness "
},
{
  "id": "well-definedness-6",
  "level": "2",
  "url": "well-definedness.html#well-definedness-6",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "2つの元に対して1つの値が定まるような関数はwell-definedである "
},
{
  "id": "choice-and-zorn",
  "level": "1",
  "url": "choice-and-zorn.html",
  "type": "Section",
  "number": "1.4",
  "title": "選択公理とZorn’s Lemma",
  "body": " 選択公理とZorn's Lemma    "
},
{
  "id": "cardinality-of-sets",
  "level": "1",
  "url": "cardinality-of-sets.html",
  "type": "Section",
  "number": "1.5",
  "title": "集合の濃度",
  "body": " 集合の濃度   厳密に言えば少しだけ不正確な記述ではあるが、これは集合の濃度の立場からすると確かに同じと言える。集合の濃度は元の個数を一般化した概念であり、それによって「無限の大きさ」のような概念を厳密に扱うことを可能にする。  この節では濃度の概念について扱う。ただし、本書では濃度の概念そのものを定義せず、濃度の比較だけを行う立場をとる。 濃度を考える際に注意することは、「集合の集まりは集合ではない」というものである。 これはすぐ後に定義する冪集合のようなものとは違い、数学的に定義可能な集合の全てを集めてきたような状況である。証明は解説しないが、この集まりを集合として考えようとすると矛盾が生じる。これを「ラッセルの逆理」という。 この節で同値関係(\"同値変形\"ではない)というものを学ぶが、集合全体の集まりに同値関係を導入し、しかるべき同値類を濃度として定義するわけにもいかないので、もっと込み入った手順が必要となることは明白である。 「順序数」とよばれる概念を定義することにより濃度の概念を定義することはできるが、この本では不要なのでそれには立ち入らない。順序数を用いた定義を含め、このラッセルの逆理を解消するテクニックについては、 著者のnote を参照していただきたい。       写像 が 単射(injective) であるとは、 が成り立つことである。 が 全射(surjective, onto) であるとは、任意の となるような が存在することである。 逆像(inverse image) が空集合でないと言い換えてもよい。 全単射(bijective) であるとは、全射かつ単射であることをいう。    集合 について、単射 が存在するとき、 と定義し、 Bの濃度はAより大きい という。 が無限集合で が有限でも と定義する。    全単射 が存在するなら と書き、 AとBの濃度は等しい という。     なら と定義する。       次に、濃度について成り立つ基本的な性質を紹介する。証明は              "
},
{
  "id": "def-bijection",
  "level": "2",
  "url": "cardinality-of-sets.html#def-bijection",
  "type": "Definition",
  "number": "1.5.1",
  "title": "",
  "body": "     写像 が 単射(injective) であるとは、 が成り立つことである。 が 全射(surjective, onto) であるとは、任意の となるような が存在することである。 逆像(inverse image) が空集合でないと言い換えてもよい。 全単射(bijective) であるとは、全射かつ単射であることをいう。    集合 について、単射 が存在するとき、 と定義し、 Bの濃度はAより大きい という。 が無限集合で が有限でも と定義する。    全単射 が存在するなら と書き、 AとBの濃度は等しい という。     なら と定義する。      "
},
{
  "id": "thm-cardinality",
  "level": "2",
  "url": "cardinality-of-sets.html#thm-cardinality",
  "type": "Theorem",
  "number": "1.5.2",
  "title": "",
  "body": "           "
},
{
  "id": "exercise-of-chapter1",
  "level": "1",
  "url": "exercise-of-chapter1.html",
  "type": "Section",
  "number": "1.6",
  "title": "第1章の演習問題と略解",
  "body": " 第1章の演習問題と略解      への全単射の例を3つ挙げよ。                           全射、単射の定義を「送られる」とか「送られてくる」というような言葉を使って表現せよ。それと全射、単射の定義を照らし合わせ、形式的な定義で何を言おうとしているのかを掴め。    単射は、値域における2つの元が等しくないならば、それぞれ違う元から送られてきていること。  全射は、値域の元を任意に取ると、それに送るような定義域の元が存在すること。     H    が全単射であることと、 が逆写像 を持つ( 、なお は入力と出力が一致する写像)ことが同値であることを証明せよ。    同値を示す問題は、まず落ち着いて と それぞれの場合に、使える仮定と示すべき目標点を明確にすることから始めよ。  この場合、 側の仮定は単射であること( )と全射であること( )である。示すべき目標は合成写像が元 を動かさないことだから、まず具体的な元を から取って考えてみればよいであろう。逆も同様にして考えよ。         をとる。 として を選ぶ。全射性より となり、 は単射だから である。次に を示す。 は全射なので なる が存在し、 は単射なので なら である(単射性の対偶)ため である。よって はただ一つの元からなり、問題の合成は に等しい。     まず とする。 をとると なら なので単射性がいえる。 だが、 なのでこれは明らか。  逆もまったく同様である。         写像 を考える。任意の部分集合 について、    と が等しいこと     が全射であることと、 であることが同値なこと   を証明せよ。            をとる。 となり、 なので、 である。仮定より なので、題意が示された。      をとる。(i)より左辺 なので である。          が全射なら に対して である。よって である。逆に に対しても があり、 なので等号がわかる。     は空でないと仮定してよい(空なら命題が意味をもたない)。 にしかなり得ないことを考えると、逆像が空ではないので全射性がわかる。            well-definednessが問題になる状況を挙げよ。    例えば ( は整数のこと)で、有理数 の分母と分子の和を返す写像として定義したいとしよう。 なので、この は1つの有理数に対して無数に像ができることになる。これはwell-definednessが問題になる例の一つである。       ならば であることを示せ。    全単射を構成することを考えよう。直積というのは順序対の全体であることを思い出して、命題2.2.2の証明での構成を参考にせよ。     に対して、 の元は という形になっているのであった。仮定より、全単射 が与えられている。 を で定義すれば、これは明らかに全単射である。実際、 なら であり、 は単射でもあるので の単射性が成り立つ。全射性も同様にして、 が全射であることから、 の逆像が空になる元は存在しないので全射性も言える。      仮定 結論 という命題において、仮定が誤っているならば、数学で通常用いる論理体系では結論は常に真である。例えば部屋にスマホがあるなら、その電源は切れているという命題を考える。 この状況で仮定が偽、つまり部屋にスマホが存在しない状況を考えれば、電源の入ったスマートフォンは部屋に存在しない。したがってこの命題は真となる。 この現象を「空虚な真」と呼ぶ。これを使って、「空集合が任意の集合の部分集合である」ことを証明せよ。    空集合から元は取れないので、部分集合の定義である という論理式は空虚な真により常に真である。     "
},
{
  "id": "exercises-chapter1-1",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-1",
  "type": "Exercise",
  "number": "1.6.1",
  "title": "",
  "body": "   への全単射の例を3つ挙げよ。                        "
},
{
  "id": "exercises-chapter1-2",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-2",
  "type": "Exercise",
  "number": "1.6.2",
  "title": "",
  "body": "  全射、単射の定義を「送られる」とか「送られてくる」というような言葉を使って表現せよ。それと全射、単射の定義を照らし合わせ、形式的な定義で何を言おうとしているのかを掴め。    単射は、値域における2つの元が等しくないならば、それぞれ違う元から送られてきていること。  全射は、値域の元を任意に取ると、それに送るような定義域の元が存在すること。   "
},
{
  "id": "ex-bijection",
  "level": "2",
  "url": "exercise-of-chapter1.html#ex-bijection",
  "type": "Exercise",
  "number": "1.6.3",
  "title": "H.",
  "body": " H    が全単射であることと、 が逆写像 を持つ( 、なお は入力と出力が一致する写像)ことが同値であることを証明せよ。    同値を示す問題は、まず落ち着いて と それぞれの場合に、使える仮定と示すべき目標点を明確にすることから始めよ。  この場合、 側の仮定は単射であること( )と全射であること( )である。示すべき目標は合成写像が元 を動かさないことだから、まず具体的な元を から取って考えてみればよいであろう。逆も同様にして考えよ。         をとる。 として を選ぶ。全射性より となり、 は単射だから である。次に を示す。 は全射なので なる が存在し、 は単射なので なら である(単射性の対偶)ため である。よって はただ一つの元からなり、問題の合成は に等しい。     まず とする。 をとると なら なので単射性がいえる。 だが、 なのでこれは明らか。  逆もまったく同様である。      "
},
{
  "id": "exercises-chapter1-4",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-4",
  "type": "Exercise",
  "number": "1.6.4",
  "title": "",
  "body": "  写像 を考える。任意の部分集合 について、    と が等しいこと     が全射であることと、 であることが同値なこと   を証明せよ。            をとる。 となり、 なので、 である。仮定より なので、題意が示された。      をとる。(i)より左辺 なので である。          が全射なら に対して である。よって である。逆に に対しても があり、 なので等号がわかる。     は空でないと仮定してよい(空なら命題が意味をもたない)。 にしかなり得ないことを考えると、逆像が空ではないので全射性がわかる。         "
},
{
  "id": "exercises-chapter1-5",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-5",
  "type": "Exercise",
  "number": "1.6.5",
  "title": "",
  "body": "  well-definednessが問題になる状況を挙げよ。    例えば ( は整数のこと)で、有理数 の分母と分子の和を返す写像として定義したいとしよう。 なので、この は1つの有理数に対して無数に像ができることになる。これはwell-definednessが問題になる例の一つである。   "
},
{
  "id": "exercises-chapter1-6",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-6",
  "type": "Exercise",
  "number": "1.6.6",
  "title": "",
  "body": "   ならば であることを示せ。    全単射を構成することを考えよう。直積というのは順序対の全体であることを思い出して、命題2.2.2の証明での構成を参考にせよ。     に対して、 の元は という形になっているのであった。仮定より、全単射 が与えられている。 を で定義すれば、これは明らかに全単射である。実際、 なら であり、 は単射でもあるので の単射性が成り立つ。全射性も同様にして、 が全射であることから、 の逆像が空になる元は存在しないので全射性も言える。   "
},
{
  "id": "exercises-chapter1-7",
  "level": "2",
  "url": "exercise-of-chapter1.html#exercises-chapter1-7",
  "type": "Exercise",
  "number": "1.6.7",
  "title": "",
  "body": "  仮定 結論 という命題において、仮定が誤っているならば、数学で通常用いる論理体系では結論は常に真である。例えば部屋にスマホがあるなら、その電源は切れているという命題を考える。 この状況で仮定が偽、つまり部屋にスマホが存在しない状況を考えれば、電源の入ったスマートフォンは部屋に存在しない。したがってこの命題は真となる。 この現象を「空虚な真」と呼ぶ。これを使って、「空集合が任意の集合の部分集合である」ことを証明せよ。    空集合から元は取れないので、部分集合の定義である という論理式は空虚な真により常に真である。   "
},
{
  "id": "definition-group",
  "level": "1",
  "url": "definition-group.html",
  "type": "Section",
  "number": "2.1",
  "title": "群の定義",
  "body": " 群の定義  群とは演算の定義された集合である。これは数であってもよいし、「群の公理」をみたす集合ならなんでも群と呼んでよい。 数の概念と真反対にある、直線の束のような図形的対象に群構造が入る場合すらも存在する(Picard群)。この多くを包括する抽象性こそが、群、より一般に代数構造の強みであり、この分野の難しさでもある。  のちに学ぶ「パリティ追跡理論」では地形に対する操作が群をなす。それがある部分集合への「作用」を定めることを確認することにより、 具体的な地形の表示をいちいち気にすることなくパリティの変化の情報を取り出すことができる。(第2部参照) ほかにも、有名な「5次以上の方程式を代数的に解くことはできない」という命題も、方程式の根がなす群と、 代数的に方程式を解く過程を表現する\"体\"(四則演算ができる集合)との対応関係を眺めることで証明できるのだ。(第4章3節参照)  群論の諸概念は決して難しいものばかりではない。しかし、その一般性と他の概念との有機的なつながりが、群論の世界を非常に豊かなものにしている。   群   空でない集合 に演算とよばれる写像 が定義されていて、以下を満たすとき、 は 群(Group) であるという。 は以下 か と書く。   単位元とよばれる元 があり、任意の となる。 はふつう と書く。    任意の に対して という元が存在し、 となる。    (結合法則)  すべての に対し、 が成り立つ。       集合に群構造が定義されるとき、その集合には群構造が 入る(induced) と表現する。群の任意の元 について可換性 が成り立つとき、その群は 可換群(Commutative group) という。可換群はアーベル群(Abelian group)や加法群(Additive group)などともいう。本によっては加法群を加群と呼んでいるが、これは大抵の場合では誤りである(加群は別の概念を指す)。   群の位数    を群とする。その元の個数 を群 の 位数(Order) という。位数有限な群のことを 有限群(finite group) といい、有限でない群を 無限群 という。     と定義する。明らかに、 に対して 指数法則 が成り立つ。  群の例を与える。    慣れ親しんだ数体系   整数     有理数     実数     複素数    は、通常用いる加法 、任意の元 に対する逆元を とすることで明らかに群になる。これらは無限群である。      同様にして は、通常の乗法 、逆元を とすることで群になる。これも無限群である。     有限群の例    とする。 とすると、これは明らかに群である。 なのでこれは有限群である。   の 乗法表(Multiplication table) 。        なお、群の単位元は一意的である。実際、 が単位元の性質を満たすなら、 である。  "
},
{
  "id": "definition-group-5",
  "level": "2",
  "url": "definition-group.html#definition-group-5",
  "type": "Definition",
  "number": "2.1.1",
  "title": "群.",
  "body": " 群   空でない集合 に演算とよばれる写像 が定義されていて、以下を満たすとき、 は 群(Group) であるという。 は以下 か と書く。   単位元とよばれる元 があり、任意の となる。 はふつう と書く。    任意の に対して という元が存在し、 となる。    (結合法則)  すべての に対し、 が成り立つ。      "
},
{
  "id": "definition-group-6",
  "level": "2",
  "url": "definition-group.html#definition-group-6",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "入る(induced) 可換群(Commutative group) "
},
{
  "id": "definition-group-7",
  "level": "2",
  "url": "definition-group.html#definition-group-7",
  "type": "Definition",
  "number": "2.1.2",
  "title": "群の位数.",
  "body": " 群の位数    を群とする。その元の個数 を群 の 位数(Order) という。位数有限な群のことを 有限群(finite group) といい、有限でない群を 無限群 という。   "
},
{
  "id": "definition-group-8",
  "level": "2",
  "url": "definition-group.html#definition-group-8",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "指数法則 "
},
{
  "id": "definition-group-10",
  "level": "2",
  "url": "definition-group.html#definition-group-10",
  "type": "Example",
  "number": "2.1.3",
  "title": "",
  "body": "  慣れ親しんだ数体系   整数     有理数     実数     複素数    は、通常用いる加法 、任意の元 に対する逆元を とすることで明らかに群になる。これらは無限群である。   "
},
{
  "id": "definition-group-11",
  "level": "2",
  "url": "definition-group.html#definition-group-11",
  "type": "Example",
  "number": "2.1.4",
  "title": "",
  "body": "  同様にして は、通常の乗法 、逆元を とすることで群になる。これも無限群である。   "
},
{
  "id": "definition-group-12",
  "level": "2",
  "url": "definition-group.html#definition-group-12",
  "type": "Example",
  "number": "2.1.5",
  "title": "有限群の例.",
  "body": " 有限群の例    とする。 とすると、これは明らかに群である。 なのでこれは有限群である。   の 乗法表(Multiplication table) 。       "
},
{
  "id": "sec-def-ring-field",
  "level": "1",
  "url": "sec-def-ring-field.html",
  "type": "Section",
  "number": "2.2",
  "title": "環, 体の定義",
  "body": " 環, 体の定義  ここでは、群に演算を加えた「環」と、その特殊な場合である「体」を定義する。群、環、体それぞれに毛色の全く異なった理論が展開されており、代数学の三本柱をなす概念となっている。     空でない集合 が 環(ring) であるとは、 上に2つの演算が以下のように定められているときをいう。      は加法 について可換群をなす。    乗法について結合法則が成り立つ。即ち、任意の元 に対して である。    分配法則が成り立つ。つまり、 である。    乗法の単位元が存在する。   乗法の交換法則( )の成り立つような環を 可換環(commutative ring) という。環の定義は乗法逆元の存在を規定していないことに注意せよ。   可換環 が 以外の乗法逆元を持つならば、 を 体(field) という。  環 が 以外の乗法逆元を持つなら を 可除環(division field) または、「不完全な体」のニュアンスをもって 斜体(skew field) という。 この辺りには流派が存在するが、この本では断らない限り、環は常に可換なものを指すとしよう。したがって単に「体」というと、可換環で乗法逆元をもつ、今定義した普通の体を指す。      明らかであるが、 は可換環になる。   自明な環    とする。通常の乗法と加法により、 は環になる。これは単純な集合であり、特別な構造を含んでいないので、 自明な環 あるいは 零環 とよばれる。 環の乗法単位元を と書くと、 では である。     二元体    とおき、演算をMod 2で考えると、これは体になる。これは二元体やブール代数(Boolean algebra)とよばれる。 将棋やチェスの盤面など、オン(1)とオフ(0)の状況での処理を高速化するテクニックであるビット演算は、この体での数値計算を指しているといってよい。 配列を用いたイテレーションでは各要素を1つずつ回っていかなければならないのに対して、ビット演算は1行単位で処理できるのが速度の秘訣である。 チェスや将棋のエンジンなど、木探索の0.1%の速度差がEloレーティングに直結する界隈では基本中の基本となる技術である。    "
},
{
  "id": "def-ring-field",
  "level": "2",
  "url": "sec-def-ring-field.html#def-ring-field",
  "type": "Definition",
  "number": "2.2.1",
  "title": "",
  "body": "   空でない集合 が 環(ring) であるとは、 上に2つの演算が以下のように定められているときをいう。      は加法 について可換群をなす。    乗法について結合法則が成り立つ。即ち、任意の元 に対して である。    分配法則が成り立つ。つまり、 である。    乗法の単位元が存在する。   乗法の交換法則( )の成り立つような環を 可換環(commutative ring) という。環の定義は乗法逆元の存在を規定していないことに注意せよ。   可換環 が 以外の乗法逆元を持つならば、 を 体(field) という。  環 が 以外の乗法逆元を持つなら を 可除環(division field) または、「不完全な体」のニュアンスをもって 斜体(skew field) という。 この辺りには流派が存在するが、この本では断らない限り、環は常に可換なものを指すとしよう。したがって単に「体」というと、可換環で乗法逆元をもつ、今定義した普通の体を指す。     "
},
{
  "id": "sec-def-ring-field-5",
  "level": "2",
  "url": "sec-def-ring-field.html#sec-def-ring-field-5",
  "type": "Example",
  "number": "2.2.2",
  "title": "自明な環.",
  "body": " 自明な環    とする。通常の乗法と加法により、 は環になる。これは単純な集合であり、特別な構造を含んでいないので、 自明な環 あるいは 零環 とよばれる。 環の乗法単位元を と書くと、 では である。   "
},
{
  "id": "sec-def-ring-field-6",
  "level": "2",
  "url": "sec-def-ring-field.html#sec-def-ring-field-6",
  "type": "Example",
  "number": "2.2.3",
  "title": "二元体.",
  "body": " 二元体    とおき、演算をMod 2で考えると、これは体になる。これは二元体やブール代数(Boolean algebra)とよばれる。 将棋やチェスの盤面など、オン(1)とオフ(0)の状況での処理を高速化するテクニックであるビット演算は、この体での数値計算を指しているといってよい。 配列を用いたイテレーションでは各要素を1つずつ回っていかなければならないのに対して、ビット演算は1行単位で処理できるのが速度の秘訣である。 チェスや将棋のエンジンなど、木探索の0.1%の速度差がEloレーティングに直結する界隈では基本中の基本となる技術である。   "
},
{
  "id": "sec-subgroup-and-generator",
  "level": "1",
  "url": "sec-subgroup-and-generator.html",
  "type": "Section",
  "number": "2.3",
  "title": "部分群と生成元",
  "body": " 部分群と生成元  何かしらの群 を調べるときに、まず初めから について何か考察するのは、目処が立ちにくい。 その代わり、 の構造を保持する、より小さい群を見るというのが常套手段である。したがって、次に定義する部分群の概念は基本的である。     を群とする。部分集合 が以下を満たすとき、 を の 部分群(subgroup) であるという。         なら      なら      上に挙げた条件(2),(3)を直接確認するよりも、 という形で一度に確認する方が少し楽な場面もある。       を群、 をその部分群とする。このとき、 も の部分群である。     なので、明らかに である。 をとると、これは に入っている。したがって、 である。     を群、 を部分集合とする。 の元を 内で という形に自由に掛け合わせたとき、その全体を と書き、 の元による 語(word) という。なお、 なら を表すとする。     は の部分群である。この は を含む最小の部分群である。     の場合により、 である。 をとると であり、指数法則から も語である。よって は の部分群である。  最小性は明らかである。実際、題意は「部分群 が なら、 である」と言い換えることができる。そのような の存在を仮定する。 をとる。 は の元の積だから、同じ演算によって の元となる。したがって題意が示された。    "
},
{
  "id": "def-subgroup",
  "level": "2",
  "url": "sec-subgroup-and-generator.html#def-subgroup",
  "type": "Definition",
  "number": "2.3.1",
  "title": "",
  "body": "   を群とする。部分集合 が以下を満たすとき、 を の 部分群(subgroup) であるという。         なら      なら      上に挙げた条件(2),(3)を直接確認するよりも、 という形で一度に確認する方が少し楽な場面もある。   "
},
{
  "id": "prop-subgroup-of-cap",
  "level": "2",
  "url": "sec-subgroup-and-generator.html#prop-subgroup-of-cap",
  "type": "Proposition",
  "number": "2.3.2",
  "title": "",
  "body": "   を群、 をその部分群とする。このとき、 も の部分群である。     なので、明らかに である。 をとると、これは に入っている。したがって、 である。   "
},
{
  "id": "sec-subgroup-and-generator-5",
  "level": "2",
  "url": "sec-subgroup-and-generator.html#sec-subgroup-and-generator-5",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "語(word) "
},
{
  "id": "prop-generated-subgroup",
  "level": "2",
  "url": "sec-subgroup-and-generator.html#prop-generated-subgroup",
  "type": "Proposition",
  "number": "2.3.3",
  "title": "",
  "body": "   は の部分群である。この は を含む最小の部分群である。     の場合により、 である。 をとると であり、指数法則から も語である。よって は の部分群である。  最小性は明らかである。実際、題意は「部分群 が なら、 である」と言い換えることができる。そのような の存在を仮定する。 をとる。 は の元の積だから、同じ演算によって の元となる。したがって題意が示された。   "
},
{
  "id": "sec-homomorphism",
  "level": "1",
  "url": "sec-homomorphism.html",
  "type": "Section",
  "number": "2.4",
  "title": "準同型写像",
  "body": " 準同型写像  群と同じくらい重要なのが、その間に走る「準同型」の概念である。群 の間にこの準同型が走っていれば、それらはほとんど同じ群であると思える。 もっと強く、「同型」があれば、 は代数的には同じものとみなしてよい。既知の群から全く未知の群へ準同型や同型が構成できれば、その未知の群を直接触らなくとも構造を調べることができる。     を群、 を写像とする。 は次を満足するとき、群の 準同型写像(homomorphism) という。「準同型」と略したりする。:  積は分解する。つまり、 がすべての について成り立つ。       が準同型なら、 である。つまり、準同型は単位元を単位元に送る。     をとる。 なので、これは の単位元である。       を準同型とする。    が逆写像を持ち、それも準同型であるとき、 同型写像(isomorphism) であるという。このとき は 同型(isomorphic) であるといい、 と書く。     と定義し、準同型の 核(kernel) と呼ぶ。     と書き、準同型の 像(image) という。          を群の準同型とする。    である。     はそれぞれ の部分群である。           なので、 に をかけて になるということは、 が の逆元であることを意味する。    両者ともに単位元の存在は自明である。  まず の場合を示す。 をとる。 。したがって は の元である。  次に の場合を示そう。 をとる。定義より、 となる が存在する。 である。 は の元であるため、題意が示された。          を全単射準同型とすると、 は同型である。    逆写像を とおく。 である。 は単射なので、 。    線型空間の間の写像を線型写像というのだったが、それは群として見ると準同型をなしている。ほかにも簡単な準同型の例をあげよう。   指数関数    なので、指数関数は実数から正の実数への準同型である。     トーラスと被覆写像   ※「複素数」が何かわからない人はOgonek:Macron氏のnoteを参照。  絶対値が1の複素数の集合を とおく。これは通常の複素数の積により群となる。直積 を考えると、これは円周 を、別の円周 にそって配置した形、つまりドーナッツ型となる。これを とおく。  まず を与える。 で単位円周上の任意の動径をもつ点を表せるから、 とすれば、先ほどの例よりこれは準同型である。この準同型単体でも、実数 の演算が円周上の点の積に保存されていることがわかる。 を とすることで準同型になる。  とくに、 を、 と定めると、 ( は整数)となる。 を動かすと、写像の軌跡が円周を何度もたどり、被覆するような形になっているのが見て取れるだろう。この写像は実数直線 を「変形」し、円周の上に重ねる写像と捉えることができる。代数トポロジーという分野ではこの状況を、 が円周 の 被覆空間(covering space) であるといい、 を 被覆写像(covering map) と呼ぶ。とくにこの場合の は普遍被覆という性質のよい被覆空間となっている。被覆空間の理論では下で紹介する自己同型群を空間の変換全体のなす群と捉え、豊富な理論が展開される。    重要な概念として自己同型群をあげておく。   自己同型群    を群とするとき、同型 全体の集合を と書く。これは積を同型の合成 とし、単位元を とすることで群となる。これを 自己同型群(automorphism group) という。    自己同型とはつまり、演算を壊さないように集合の元だけを「置換」する、自己変換のなす群とみなせる。  "
},
{
  "id": "def-homomorphism",
  "level": "2",
  "url": "sec-homomorphism.html#def-homomorphism",
  "type": "Definition",
  "number": "2.4.1",
  "title": "",
  "body": "   を群、 を写像とする。 は次を満足するとき、群の 準同型写像(homomorphism) という。「準同型」と略したりする。:  積は分解する。つまり、 がすべての について成り立つ。   "
},
{
  "id": "prop-hom-and-unit",
  "level": "2",
  "url": "sec-homomorphism.html#prop-hom-and-unit",
  "type": "Proposition",
  "number": "2.4.2",
  "title": "",
  "body": "   が準同型なら、 である。つまり、準同型は単位元を単位元に送る。     をとる。 なので、これは の単位元である。   "
},
{
  "id": "def-isom",
  "level": "2",
  "url": "sec-homomorphism.html#def-isom",
  "type": "Definition",
  "number": "2.4.3",
  "title": "",
  "body": "   を準同型とする。    が逆写像を持ち、それも準同型であるとき、 同型写像(isomorphism) であるという。このとき は 同型(isomorphic) であるといい、 と書く。     と定義し、準同型の 核(kernel) と呼ぶ。     と書き、準同型の 像(image) という。      "
},
{
  "id": "prop-hom-basic",
  "level": "2",
  "url": "sec-homomorphism.html#prop-hom-basic",
  "type": "Proposition",
  "number": "2.4.4",
  "title": "",
  "body": "   を群の準同型とする。    である。     はそれぞれ の部分群である。           なので、 に をかけて になるということは、 が の逆元であることを意味する。    両者ともに単位元の存在は自明である。  まず の場合を示す。 をとる。 。したがって は の元である。  次に の場合を示そう。 をとる。定義より、 となる が存在する。 である。 は の元であるため、題意が示された。      "
},
{
  "id": "prop-biject-hom",
  "level": "2",
  "url": "sec-homomorphism.html#prop-biject-hom",
  "type": "Proposition",
  "number": "2.4.5",
  "title": "",
  "body": "   を全単射準同型とすると、 は同型である。    逆写像を とおく。 である。 は単射なので、 。   "
},
{
  "id": "sec-homomorphism-9",
  "level": "2",
  "url": "sec-homomorphism.html#sec-homomorphism-9",
  "type": "Example",
  "number": "2.4.6",
  "title": "指数関数.",
  "body": " 指数関数    なので、指数関数は実数から正の実数への準同型である。   "
},
{
  "id": "sec-homomorphism-10",
  "level": "2",
  "url": "sec-homomorphism.html#sec-homomorphism-10",
  "type": "Example",
  "number": "2.4.7",
  "title": "トーラスと被覆写像.",
  "body": " トーラスと被覆写像   ※「複素数」が何かわからない人はOgonek:Macron氏のnoteを参照。  絶対値が1の複素数の集合を とおく。これは通常の複素数の積により群となる。直積 を考えると、これは円周 を、別の円周 にそって配置した形、つまりドーナッツ型となる。これを とおく。  まず を与える。 で単位円周上の任意の動径をもつ点を表せるから、 とすれば、先ほどの例よりこれは準同型である。この準同型単体でも、実数 の演算が円周上の点の積に保存されていることがわかる。 を とすることで準同型になる。  とくに、 を、 と定めると、 ( は整数)となる。 を動かすと、写像の軌跡が円周を何度もたどり、被覆するような形になっているのが見て取れるだろう。この写像は実数直線 を「変形」し、円周の上に重ねる写像と捉えることができる。代数トポロジーという分野ではこの状況を、 が円周 の 被覆空間(covering space) であるといい、 を 被覆写像(covering map) と呼ぶ。とくにこの場合の は普遍被覆という性質のよい被覆空間となっている。被覆空間の理論では下で紹介する自己同型群を空間の変換全体のなす群と捉え、豊富な理論が展開される。   "
},
{
  "id": "sec-homomorphism-12",
  "level": "2",
  "url": "sec-homomorphism.html#sec-homomorphism-12",
  "type": "Definition",
  "number": "2.4.8",
  "title": "自己同型群.",
  "body": " 自己同型群    を群とするとき、同型 全体の集合を と書く。これは積を同型の合成 とし、単位元を とすることで群となる。これを 自己同型群(automorphism group) という。   "
},
{
  "id": "sec-quot-grp",
  "level": "1",
  "url": "sec-quot-grp.html",
  "type": "Section",
  "number": "2.5",
  "title": "剰余群",
  "body": " 剰余群  なんらかの対象を、別の対象と同じものとしてみなしたいという意識は、数学の至る所に登場する。それは群論においても同様である。この節では、集合の元同士にある種の関係を定義し、その集合を互いに素なものに分割する「同値関係」という概念を学ぶ。  一般の同値関係を考える前に、mod演算を復習する。より丁寧で詳しい解説は Ogonek:Macron氏のnote を参照のこと。  正の整数 をとる。 に関して、 が で割り切れるとき、 と書くのだった。この記号で無限環である の元をあまりの概念を用いてグループ分けし、構造を大幅に簡略化していることがわかるであろう。  mod演算はこのように、状況に応じて整数の構造を簡略化することで、より高度な概念を簡単に考えられる定式化である。「LTEの補題」はその典型例であり、数論の「楕円曲線論」という分野で使用されることがある。そのほか、いわゆる数学オリンピックの整数問題において、\"Vieta Jumping\"などの手法とあわせて絶大な威力を発揮し、問題と出場者のレベルの上昇を起こしたようである。  今見たように、mod演算での整数の分割は豊富な理論をもつ。これを一般の群やその他の代数構造に拡張するため、mod演算の持つ性質を取り出し、同値関係の概念を定義する。   同値関係       集合A上の元同士の関係 が次を満たすとき、 を の 同値関係(equivalence relation) という。   (反射律)       (対称律)       (推移律)           の同値関係 と任意の に対して、集合 を の 同値類(equivalence class) という。        明らかに、modによる整数の分割は同値関係である。つまり、関係 は上の定義の条件を全て満たす。実際、   反射律と対称律は明らか。     と書けたとする。 である。      次に、さきほど見た「整数の分割」を、任意の集合に対して一般化する。     を集合、 をその上の同値関係とする。    によって作られた同値類の全体を と書き、 の による 商(quotient) という。 の各元に対して の集合が1つ対応する。これを から への 自然な写像(natural map) という。     の元 に対し、 となる元を の代表元という。これは同値類をラベリングするだけの元なので適当に選んでよい。     の部分集合が各同値類の代表元をちょうど1つずつ含むなら、それを の 完全代表系(representative) という。       選択公理(第2章4節)より、すべての同値類から代表元を1つずつ選ぶことが可能である。よって、ZFCでは完全代表系は常に存在する。    剰余類  群の剰余類を定義しよう。まだこれは剰余群の定義ではない。     を群、 をその部分群、 とする。 であるとき、 と定義する。これは明らかに同値関係であり、商集合 を の による 左剰余類(left quotient class) という。同様に も同値関係となり、商集合をとることによって右剰余類を定義できる。    明らかに、 が可換なら右剰余類と左剰余類は一致する。     を群、 をその部分群とする。任意の に対して となるとき、 は の 正規部分群(normal subgroup) であるといい、 と書く。     が可換なら なので、 は常に正規部分群である。     を準同型とするとき、 である。     をとる。 であり、 なので示せた。      剰余群  では、お待ちかねの剰余群を定義しよう。そのために次の補題を示す。     を の正規部分群とし、 とする。このとき である。なお、 である。     をとる。 とすると で、 である。これで がいえた。同様にして も成り立つ。    上の補題は正規部分群なら剰余類が一致することを言っている。   の元 を、それぞれの代表元 をとって と表す。 に対する演算を、 で定義する。  さて、勘のいい読者は気づかれたかもしれないが、この演算はwell-definednessが問題になる。どういうことかというと、この演算は要は集合から元を1つ適当に選び(代表元の定義を参照)、それともう1つの代表元をかけているのである。代表元は選び方に特に制約を設けていない以上、異なる元 ( の場合も同様)を選んで計算しても、最終的にそれらがイコールで結ばれることを証明しないといけないのである。  このように、剰余をとるときにはwell-definednessが絡んでくるのである。以下、その証明を行う。   の元は を使うことで と書ける。すると だが、 が正規部分群なので である。これを用いると とでき、両者の剰余類が等しいことがわかる。   が群となることは明らかである。実際、単位元は とすればよく、 なので結合法則が成り立つ。逆元も とすればよい。    上の考察により定まった群を の による 剰余群(quotient group) という。    商集合の定義で触れた自然な写像 は全射準同型であり、 である。証明は容易なので、各自が試してみるとよい。   "
},
{
  "id": "def-equi-relation",
  "level": "2",
  "url": "sec-quot-grp.html#def-equi-relation",
  "type": "Definition",
  "number": "2.5.1",
  "title": "",
  "body": "     集合A上の元同士の関係 が次を満たすとき、 を の 同値関係(equivalence relation) という。   (反射律)       (対称律)       (推移律)           の同値関係 と任意の に対して、集合 を の 同値類(equivalence class) という。      "
},
{
  "id": "subsec-equiv-relation-3",
  "level": "2",
  "url": "sec-quot-grp.html#subsec-equiv-relation-3",
  "type": "Remark",
  "number": "2.5.2",
  "title": "",
  "body": " 明らかに、modによる整数の分割は同値関係である。つまり、関係 は上の定義の条件を全て満たす。実際、   反射律と対称律は明らか。     と書けたとする。 である。     "
},
{
  "id": "def-quot-set",
  "level": "2",
  "url": "sec-quot-grp.html#def-quot-set",
  "type": "Definition",
  "number": "2.5.3",
  "title": "",
  "body": "   を集合、 をその上の同値関係とする。    によって作られた同値類の全体を と書き、 の による 商(quotient) という。 の各元に対して の集合が1つ対応する。これを から への 自然な写像(natural map) という。     の元 に対し、 となる元を の代表元という。これは同値類をラベリングするだけの元なので適当に選んでよい。     の部分集合が各同値類の代表元をちょうど1つずつ含むなら、それを の 完全代表系(representative) という。      "
},
{
  "id": "def-grp-quot-class",
  "level": "2",
  "url": "sec-quot-grp.html#def-grp-quot-class",
  "type": "Definition",
  "number": "2.5.4",
  "title": "",
  "body": "   を群、 をその部分群、 とする。 であるとき、 と定義する。これは明らかに同値関係であり、商集合 を の による 左剰余類(left quotient class) という。同様に も同値関係となり、商集合をとることによって右剰余類を定義できる。   "
},
{
  "id": "def-normal-subgrp",
  "level": "2",
  "url": "sec-quot-grp.html#def-normal-subgrp",
  "type": "Definition",
  "number": "2.5.5",
  "title": "",
  "body": "   を群、 をその部分群とする。任意の に対して となるとき、 は の 正規部分群(normal subgroup) であるといい、 と書く。   "
},
{
  "id": "subsec-quot-group-7",
  "level": "2",
  "url": "sec-quot-grp.html#subsec-quot-group-7",
  "type": "Proposition",
  "number": "2.5.6",
  "title": "",
  "body": "   を準同型とするとき、 である。     をとる。 であり、 なので示せた。   "
},
{
  "id": "sec-quot-grp-9-3",
  "level": "2",
  "url": "sec-quot-grp.html#sec-quot-grp-9-3",
  "type": "Lemma",
  "number": "2.5.7",
  "title": "",
  "body": "   を の正規部分群とし、 とする。このとき である。なお、 である。     をとる。 とすると で、 である。これで がいえた。同様にして も成り立つ。   "
},
{
  "id": "sec-quot-grp-9-10",
  "level": "2",
  "url": "sec-quot-grp.html#sec-quot-grp-9-10",
  "type": "Definition",
  "number": "2.5.8",
  "title": "",
  "body": "  上の考察により定まった群を の による 剰余群(quotient group) という。   "
},
{
  "id": "sec-hom-theorems",
  "level": "1",
  "url": "sec-hom-theorems.html",
  "type": "Section",
  "number": "2.6",
  "title": "準同型定理",
  "body": " 準同型定理  この節では、群論やその他の代数構造における非常に重要かつ便利な定理である「準同型定理」を解説する。   可換図式  その前に、まずは「可換図式」という、数学における便利な記法について学ぼう。   図式 とは、次のように写像の関係を図示したものである:     この図式が 可換(commutative) であるとは、 が成り立つことである。中央の は図式の可換性を表す。つけない流儀もあり、本書ではそちらを採用する。  特定の写像 について存在性を言う定理の場合、主張の図式の矢印は破線で書かれることが多い:     全射性と単射性も矢印の形で表現する:       準同型定理     第一同型定理  まずは最重要である、第一同型定理を示そう。    を準同型とする。 とするとき、次を可換にするような が一意的に存在し、同型 を与える。       この証明はまず     の構成   とおく。 に対して、 と定義する。  well-definednessを示す。 を任意にとると、 なので、 はwell-definedである。  準同型であることを言う。 となる。  最後に可換性を言おう。 を示せばよい。 をとると、 はある剰余類 に送られる。定義より だから、 となる。    同型  全単射性を示せば、 より、これは同型になる。   なら なので であり、 は の単位元だから、これは単射。 なら なので、 である。同様に、 である。 は定義より常に全射だから、 である。    最後に一意性だが、任意の が なら と値が定まるので、言うまでもなく一意的である。        準同型定理の意味するところは要するに「 があれば、 の中に の部分構造で同型なものが存在し、それが と書ける」というところである。     ( は の元を の元とみなす 包含写像(inclusion) )  このように、対象の「内部に同型な部分構造を見出す」ことを数学の言葉で 埋め込み(immersion) という。この例では、 を、同型 によって に埋め込んでいると考えられる。     第二同型定理       "
},
{
  "id": "sec-hom-theorems-3-3",
  "level": "2",
  "url": "sec-hom-theorems.html#sec-hom-theorems-3-3",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "図式 "
},
{
  "id": "sec-hom-theorems-3-5",
  "level": "2",
  "url": "sec-hom-theorems.html#sec-hom-theorems-3-5",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "可換(commutative) "
},
{
  "id": "thm-1st-isom",
  "level": "2",
  "url": "sec-hom-theorems.html#thm-1st-isom",
  "type": "Theorem",
  "number": "2.6.1",
  "title": "第一同型定理.",
  "body": " 第一同型定理  まずは最重要である、第一同型定理を示そう。    を準同型とする。 とするとき、次を可換にするような が一意的に存在し、同型 を与える。       この証明はまず     の構成   とおく。 に対して、 と定義する。  well-definednessを示す。 を任意にとると、 なので、 はwell-definedである。  準同型であることを言う。 となる。  最後に可換性を言おう。 を示せばよい。 をとると、 はある剰余類 に送られる。定義より だから、 となる。    同型  全単射性を示せば、 より、これは同型になる。   なら なので であり、 は の単位元だから、これは単射。 なら なので、 である。同様に、 である。 は定義より常に全射だから、 である。    最後に一意性だが、任意の が なら と値が定まるので、言うまでもなく一意的である。      "
},
{
  "id": "sec-hom-theorems-4-4",
  "level": "2",
  "url": "sec-hom-theorems.html#sec-hom-theorems-4-4",
  "type": "Remark",
  "number": "2.6.2",
  "title": "",
  "body": " 準同型定理の意味するところは要するに「 があれば、 の中に の部分構造で同型なものが存在し、それが と書ける」というところである。     ( は の元を の元とみなす 包含写像(inclusion) )  このように、対象の「内部に同型な部分構造を見出す」ことを数学の言葉で 埋め込み(immersion) という。この例では、 を、同型 によって に埋め込んでいると考えられる。  "
},
{
  "id": "thm-second-isom",
  "level": "2",
  "url": "sec-hom-theorems.html#thm-second-isom",
  "type": "Theorem",
  "number": "2.6.3",
  "title": "",
  "body": "  第二同型定理     "
},
{
  "id": "sec-ex-chap2",
  "level": "1",
  "url": "sec-ex-chap2.html",
  "type": "Section",
  "number": "2.7",
  "title": "第2章の演習問題と略解",
  "body": " 第2章の演習問題と略解        "
},
{
  "id": "sec-ex-chap2-2",
  "level": "2",
  "url": "sec-ex-chap2.html#sec-ex-chap2-2",
  "type": "Checkpoint",
  "number": "2.7.1",
  "title": "",
  "body": "     "
},
{
  "id": "subsec-agyou",
  "level": "1",
  "url": "subsec-agyou.html",
  "type": "Subsection",
  "number": "3.1",
  "title": "あ行",
  "body": " あ行      明らか   明らか, 自明(Obvious, Clear)   本来は「誰がみてもすぐに分かるさま」を意味する言葉であるが、大学数学、とくに修士以降の本では「考えればすぐにわかる」とか、「読者の演習問題として残す」というニュアンスを含むことが多くなる。甚だ身勝手な使い方である。だがもしこの言葉を見たら、「ふーん、そうなんだ」で終わらず、自分で考える癖をつけていただきたい。  (類) 容易      一般化   一般化(generalization)   ある命題や定義を包含する枠組みで、同様の結果を得ること。例えばピタゴラスの定理( )の一般化は余弦定理( )であり、圏でのlimit\/colimitは集合のDisjoin union\/直積の一般化である、等。  (対) 特殊化(specialization)      一般性を失わない, 仮定してよい   一般性を失わない(without loss of generality), 〜と仮定してよい(one(we) may assume 〜)   命題の証明において、同様だが複数のケースが考えられる場合、ある仮定Aをおいて状況を簡単にして、それで証明をし、残りのケースもAでの場合を使って示せる場合、「Aと仮定しても一般性を失わない」として議論が省略される。「他の場合も示せる」という状況は、例えば実数 についてなにがしかの命題Pを示したいとき、 とおくとその場合だけ証明できたとする。 と を入れ替えると の場合も成り立つので、この仮定をおいて一般性を失っていないと言える。これも出てきたら自分で示せるとなおよい。      "
},
{
  "id": "subsec-agyou-2",
  "level": "2",
  "url": "subsec-agyou.html#subsec-agyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "明らか, 自明(Obvious, Clear) 一般化(generalization) 一般性を失わない(without loss of generality), 〜と仮定してよい(one(we) may assume 〜) "
},
{
  "id": "subsec-kagyou",
  "level": "1",
  "url": "subsec-kagyou.html",
  "type": "Subsection",
  "number": "3.2",
  "title": "か行",
  "body": " か行       〜が存在する   〜が存在する(〜exists, there is(are) 〜)   文字通り「〜がある」という意味。ただし、それがただ一つであるとは 限らない 。複数個でもよい。        系   系(Corollary)   命題や定理が証明されたのち、それからただちに導かれるもの。著者によっては、加えて「興味深い命題」というニュアンスを付加していることもある。       "
},
{
  "id": "subsec-kagyou-2",
  "level": "2",
  "url": "subsec-kagyou.html#subsec-kagyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "〜が存在する(〜exists, there is(are) 〜) 限らない 系(Corollary) "
},
{
  "id": "subsec-sagyou",
  "level": "1",
  "url": "subsec-sagyou.html",
  "type": "Subsection",
  "number": "3.3",
  "title": "さ行",
  "body": " さ行       自然な   自然な(natural, canonical)   恣意的な選択を含まず、考えているものから一意的に、あるいは標準的に定まる対象。圏論的にはより厳密に定義される。難しいことを書いたが、要は「最も標準的で美しい対応」をなしているものとして認識しておけばよい。これは数学的感覚によるものが大きいので、実際に自然な対象と呼ばれるものたち(包含写像など)を見てみるのがよい。  例: 群 から剰余群 への自然な全射 。       "
},
{
  "id": "subsec-sagyou-2",
  "level": "2",
  "url": "subsec-sagyou.html#subsec-sagyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "自然な(natural, canonical) "
},
{
  "id": "subsec-tagyou",
  "level": "1",
  "url": "subsec-tagyou.html",
  "type": "Subsection",
  "number": "3.4",
  "title": "た行",
  "body": " た行       定理   定理(Theorem)   命題のうち、特に理論的に重要であるものや、便利であるもの。このあたりの命名規則に明確な線引きは存在せず、分野によって異なる暗黙の了解によって振り分けられるのが基本だが、著者の裁量で変化しうる。       "
},
{
  "id": "subsec-tagyou-2",
  "level": "2",
  "url": "subsec-tagyou.html#subsec-tagyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "定理(Theorem) "
},
{
  "id": "subsec-nagyou",
  "level": "1",
  "url": "subsec-nagyou.html",
  "type": "Subsection",
  "number": "3.5",
  "title": "な行",
  "body": " な行       任意の   任意の(any〜)   すべての〜 という意味。  (対) 〜が存在する       "
},
{
  "id": "subsec-nagyou-2",
  "level": "2",
  "url": "subsec-nagyou.html#subsec-nagyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "任意の(any〜) "
},
{
  "id": "subsec-hagyou",
  "level": "1",
  "url": "subsec-hagyou.html",
  "type": "Subsection",
  "number": "3.6",
  "title": "は行",
  "body": " は行       補題   補題(Lemma)   命題のうち、便利であったり、のちの証明に利用されるもの。「補助命題」の略であり、一見すると重要度が低そうだが、実情はそれと対照的である。       "
},
{
  "id": "subsec-hagyou-2",
  "level": "2",
  "url": "subsec-hagyou.html#subsec-hagyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "補題(Lemma) "
},
{
  "id": "subsec-magyou",
  "level": "1",
  "url": "subsec-magyou.html",
  "type": "Subsection",
  "number": "3.7",
  "title": "ま行",
  "body": " ま行       矛盾          命題   命題(Proposition)   仮定 結論 という形の文。       "
},
{
  "id": "subsec-magyou-2",
  "level": "2",
  "url": "subsec-magyou.html#subsec-magyou-2",
  "type": "Paragraph (with a defined term)",
  "number": "",
  "title": "",
  "body": "命題(Proposition) "
},
{
  "id": "subsec-yagyou",
  "level": "1",
  "url": "subsec-yagyou.html",
  "type": "Subsection",
  "number": "3.8",
  "title": "や行",
  "body": " や行  "
},
{
  "id": "subsec-ragyou",
  "level": "1",
  "url": "subsec-ragyou.html",
  "type": "Subsection",
  "number": "3.9",
  "title": "ら行",
  "body": " ら行  "
},
{
  "id": "subsec-wagyou",
  "level": "1",
  "url": "subsec-wagyou.html",
  "type": "Subsection",
  "number": "3.10",
  "title": "わ行",
  "body": " わ行  "
},
{
  "id": "backmatter-2",
  "level": "1",
  "url": "backmatter-2.html",
  "type": "Colophon",
  "number": "",
  "title": "Colophon",
  "body": " This book was authored in PreTeXt .  "
}
]

var ptx_lunr_idx = lunr(function () {
  this.ref('id')
  this.field('title')
  this.field('body')
  this.metadataWhitelist = ['position']

  ptx_lunr_docs.forEach(function (doc) {
    this.add(doc)
  }, this)
})
